<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 144, 256"/>
			<output>
				<port id="0" names="input_1:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_4685" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_4687" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input_1/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv2D/filter" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="Conv2D/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv2d_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="876" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="conv2d_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2d_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="mul_1" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv2D_2/filter" type="Const" version="opset1">
			<data element_type="f16" offset="908" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_2/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv2D_2" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_2:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2d_1_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="1420" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="conv2d_1_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2d_1_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_1_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="re_lu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="depthwise/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="1452" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="depthwise/filter_in:0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="depthwise_conv2d/y" type="Const" version="opset1">
			<data element_type="f16" offset="1740" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="depthwise_conv2d/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="depthwise_conv2d" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_conv2d:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="re_lu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="692411903" type="Const" version="opset1">
			<data element_type="i64" offset="1772" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="global_average_pooling2d" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="global_average_pooling2d:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv2D_3/filter" type="Const" version="opset1">
			<data element_type="f16" offset="1788" shape="8, 16, 1, 1" size="256"/>
			<output>
				<port id="0" names="Conv2D_3/filter:0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv2D_3" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_3:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2d_2_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="2044" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" names="conv2d_2_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_2_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_2_1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="re_lu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_2:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv2D_4/filter" type="Const" version="opset1">
			<data element_type="f16" offset="2060" shape="16, 8, 1, 1" size="256"/>
			<output>
				<port id="0" names="Conv2D_4/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv2D_4" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_4:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2d_3_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="2316" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="conv2d_3_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2d_3_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_3_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="activation" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="multiply:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv2D_5/filter" type="Const" version="opset1">
			<data element_type="f16" offset="2348" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_5/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv2D_5" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_5:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2d_4_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="2860" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="conv2d_4_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv2d_4_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_4_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv2D_6/filter" type="Const" version="opset1">
			<data element_type="f16" offset="2892" shape="72, 16, 1, 1" size="2304"/>
			<output>
				<port id="0" names="Conv2D_6/filter:0" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv2D_6" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_6:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv2d_5_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="5196" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" names="conv2d_5_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv2d_5_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_5_1:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="re_lu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_3:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="depthwise_1/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="5340" shape="72, 1, 1, 3, 3" size="1296"/>
			<output>
				<port id="0" names="depthwise_1/filter_in:0" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_1:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="depthwise_conv2d_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="6636" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" names="depthwise_conv2d_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="depthwise_conv2d_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_conv2d_1:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="re_lu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_4:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv2D_7/filter" type="Const" version="opset1">
			<data element_type="f16" offset="6780" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="Conv2D_7/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv2D_7" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_7:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv2d_6_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="10236" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" names="conv2d_6_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv2d_6_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_6_1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv2D_8/filter" type="Const" version="opset1">
			<data element_type="f16" offset="10284" shape="88, 24, 1, 1" size="4224"/>
			<output>
				<port id="0" names="Conv2D_8/filter:0" precision="FP16">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv2D_8" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_8:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv2d_7_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="14508" shape="1, 88, 1, 1" size="176"/>
			<output>
				<port id="0" names="conv2d_7_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv2d_7_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_7_1:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="re_lu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_5:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="depthwise_2/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="14684" shape="88, 1, 1, 3, 3" size="1584"/>
			<output>
				<port id="0" names="depthwise_2/filter_in:0" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_2:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="depthwise_conv2d_2/y" type="Const" version="opset1">
			<data element_type="f16" offset="16268" shape="1, 88, 1, 1" size="176"/>
			<output>
				<port id="0" names="depthwise_conv2d_2/y:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="depthwise_conv2d_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_conv2d_2:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="re_lu_6" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_6:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv2D_9/filter" type="Const" version="opset1">
			<data element_type="f16" offset="16444" shape="24, 88, 1, 1" size="4224"/>
			<output>
				<port id="0" names="Conv2D_9/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv2D_9" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_9:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2d_8_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="20668" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" names="conv2d_8_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2d_8_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_8_1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="add__xeno_compat__1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="add__xeno_compat__1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv2D_10/filter" type="Const" version="opset1">
			<data element_type="f16" offset="20716" shape="96, 24, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_10/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv2D_10" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_10:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv2d_9_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="25324" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" names="conv2d_9_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv2d_9_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_9_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="mul_3" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="depthwise_3/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="25516" shape="96, 1, 1, 5, 5" size="4800"/>
			<output>
				<port id="0" names="depthwise_3/filter_in:0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="2, 2" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="depthwise_conv2d_3/y" type="Const" version="opset1">
			<data element_type="f16" offset="30316" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" names="depthwise_conv2d_3/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="depthwise_conv2d_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_conv2d_3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="mul_5" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_5:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="697411951" type="Const" version="opset1">
			<data element_type="i64" offset="1772" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="global_average_pooling2d_1" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="global_average_pooling2d_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv2D_11/filter" type="Const" version="opset1">
			<data element_type="f16" offset="30508" shape="24, 96, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_11/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv2D_11" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_11:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2d_10_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="35116" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" names="conv2d_10_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2d_10_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_10_1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="re_lu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_7:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv2D_12/filter" type="Const" version="opset1">
			<data element_type="f16" offset="35164" shape="96, 24, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_12/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv2D_12" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_12:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv2d_11_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="39772" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" names="conv2d_11_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv2d_11_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_11_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="activation_1" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="multiply_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv2D_13/filter" type="Const" version="opset1">
			<data element_type="f16" offset="39964" shape="32, 96, 1, 1" size="6144"/>
			<output>
				<port id="0" names="Conv2D_13/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv2D_13" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_13:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv2d_12_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="46108" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="conv2d_12_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv2d_12_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_12_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv2D_14/filter" type="Const" version="opset1">
			<data element_type="f16" offset="46172" shape="128, 32, 1, 1" size="8192"/>
			<output>
				<port id="0" names="Conv2D_14/filter:0" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv2D_14" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_14:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv2d_13_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="54364" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="conv2d_13_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv2d_13_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_13_1:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="mul_7" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_7:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="depthwise_4/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="54620" shape="128, 1, 1, 5, 5" size="6400"/>
			<output>
				<port id="0" names="depthwise_4/filter_in:0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_4:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="depthwise_conv2d_4/y" type="Const" version="opset1">
			<data element_type="f16" offset="61020" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="depthwise_conv2d_4/y:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="depthwise_conv2d_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_conv2d_4:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="mul_9" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_9:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="700012116" type="Const" version="opset1">
			<data element_type="i64" offset="1772" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="global_average_pooling2d_2" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="global_average_pooling2d_2:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv2D_15/filter" type="Const" version="opset1">
			<data element_type="f16" offset="61276" shape="32, 128, 1, 1" size="8192"/>
			<output>
				<port id="0" names="Conv2D_15/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv2D_15" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_15:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv2d_14_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="69468" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="conv2d_14_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv2d_14_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_14_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="re_lu_8" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_8:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv2D_16/filter" type="Const" version="opset1">
			<data element_type="f16" offset="69532" shape="128, 32, 1, 1" size="8192"/>
			<output>
				<port id="0" names="Conv2D_16/filter:0" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv2D_16" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_16:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv2d_15_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="77724" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="conv2d_15_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="conv2d_15_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
