<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 192, 192"/>
			<output>
				<port id="0" names="input_1:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_9734" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_9736" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input_1/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1458524981" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1459124765" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_15" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="model_1/model/zero_padding2d/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>194</dim>
					<dim>194</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv2D/filter" type="Const" version="opset1">
			<data element_type="f16" offset="46" shape="32, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="Conv2D/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>194</dim>
					<dim>194</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Add/y" type="Const" version="opset1">
			<data element_type="f16" offset="1774" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="Add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model_1/model/activation/Relu_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation/Relu_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="1459725257" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="1460324678" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_32" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="model_1/model/zero_padding2d_1/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_1/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="depthwise/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="1838" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="depthwise/filter_in:0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="2414" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv2D_1/filter" type="Const" version="opset1">
			<data element_type="f16" offset="2478" shape="8, 32, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_1/filter:0" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv2D_1" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add_1/y" type="Const" version="opset1">
			<data element_type="f16" offset="2990" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" names="Add_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_1/model/activation_1/Relu_model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_1/Relu_model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="1460924834" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="1461525260" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_57" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="30" name="model_1/model/zero_padding2d_2/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_2/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="depthwise_1/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="3006" shape="8, 1, 1, 3, 3" size="144"/>
			<output>
				<port id="0" names="depthwise_1/filter_in:0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_1/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="3150" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_1/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_1/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_1/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv2D_2/filter" type="Const" version="opset1">
			<data element_type="f16" offset="3166" shape="32, 8, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_2/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv2D_2" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_2:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_2/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" offset="3678" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_2/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_2/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_2/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_2:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model_1/model/activation_2/Relu_model_1/model/add/add" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_2/Relu_model_1/model/add/add:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="1462124744" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="1462724666" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_84" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="44" name="model_1/model/zero_padding2d_3/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_3/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="depthwise_2/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="3742" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="depthwise_2/filter_in:0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_2:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_2/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="4318" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_2/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_2/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_2/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv2D_3/filter" type="Const" version="opset1">
			<data element_type="f16" offset="4382" shape="8, 32, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_3/filter:0" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv2D_3" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_3:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Add_3/y" type="Const" version="opset1">
			<data element_type="f16" offset="4894" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" names="Add_3/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_3:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model_1/model/activation_3/Relu_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_3/Relu_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="1463324876" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="1463925413" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_109" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="57" name="model_1/model/zero_padding2d_4/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_4/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="depthwise_3/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="4910" shape="8, 1, 1, 3, 3" size="144"/>
			<output>
				<port id="0" names="depthwise_3/filter_in:0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_3:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise1/y" type="Const" version="opset1">
			<data element_type="f16" offset="5054" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv2D_4/filter" type="Const" version="opset1">
			<data element_type="f16" offset="5070" shape="32, 8, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_4/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv2D_4" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_4:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_4/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" offset="5582" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_4/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_4/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/conv2d_4/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_4:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model_1/model/activation_4/Relu_model_1/model/add_1/add" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_4/Relu_model_1/model/add_1/add:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1464524750" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1465125155" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_136" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="71" name="model_1/model/zero_padding2d_5/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_5/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="depthwise_4/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="5646" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="depthwise_4/filter_in:0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>98</dim>
					<dim>98</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_4:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_4/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="6222" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_4/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_4/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_79/FusedBatchNormV3_model_1/model/depthwise_conv2d_37/depthwise_model_1/model/depthwise_conv2d_4/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv2D_5/filter" type="Const" version="opset1">
			<data element_type="f16" offset="6286" shape="16, 32, 1, 1" size="1024"/>
			<output>
				<port id="0" names="Conv2D_5/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv2D_5" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_5:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Add_5/y" type="Const" version="opset1">
			<data element_type="f16" offset="7310" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="Add_5/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_5:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model_1/model/activation_5/Relu_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/conv2d_5/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_5/Relu_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/conv2d_5/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="1465724813" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1466325074" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_161" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="84" name="model_1/model/zero_padding2d_6/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_6/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="depthwise_5/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="7342" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="depthwise_5/filter_in:0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="depthwise_5" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_5:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/depthwise_conv2d_5/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="7630" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/depthwise_conv2d_5/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/depthwise_conv2d_5/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/batch_normalization_19/FusedBatchNormV3_model_1/model/depthwise_conv2d_9/depthwise_model_1/model/depthwise_conv2d_5/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv2D_6/filter" type="Const" version="opset1">
			<data element_type="f16" offset="7662" shape="64, 16, 1, 1" size="2048"/>
			<output>
				<port id="0" names="Conv2D_6/filter:0" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv2D_6" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_6:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Add_6/y" type="Const" version="opset1">
			<data element_type="f16" offset="9710" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" names="Add_6/y:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_6:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model_1/model/activation_6/Relu_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/conv2d_6/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_6/Relu_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/conv2d_6/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="1466924552" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1467524702" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_186" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="97" name="model_1/model/zero_padding2d_7/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="model_1/model/zero_padding2d_7/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="depthwise_6/filter_in" type="Const" version="opset1">
			<data element_type="f16" offset="9838" shape="64, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="depthwise_6/filter_in:0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="depthwise_6" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_6:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/depthwise_conv2d_6/depthwise/y" type="Const" version="opset1">
			<data element_type="f16" offset="10990" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/depthwise_conv2d_6/depthwise/y:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/depthwise_conv2d_6/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/depthwise_conv2d_36/depthwise_model_1/model/depthwise_conv2d_41/depthwise_model_1/model/depthwise_conv2d_6/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv2D_7/filter" type="Const" version="opset1">
			<data element_type="f16" offset="11118" shape="16, 64, 1, 1" size="2048"/>
			<output>
				<port id="0" names="Conv2D_7/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
